/* eslint-disable max-len */

export function AboutUs() {
  return (
    <>
      <h2 className="container mx-auto px-4 mt-16 mb-8 text-3xl font-semibold">О нас</h2>
      <div
        className="container mx-auto px-[114px] h-[567px] text-white bg-aboutUs bg-[#301700] bg-opacity-60 bg-blend-multiply flex flex-col justify-center"
        id="about-us"
      >
        <div className="w-[450px]">
          <p>
            Приветствуем вас в&nbsp;нашем мире канцелярских решений! Наша компания является лидером в&nbsp;Лиде и&nbsp;специализируется на&nbsp;оптовых продажах фирмам. С&nbsp;более чем 10-летним опытом на&nbsp;рынке, мы&nbsp;гордимся предлагаемыми нами низкими ценами и&nbsp;обширной базой постоянных клиентов.
          </p>
        </div>
        <div className=" self-end w-[451px]">
          <p>
            Мы&nbsp;стремимся вдохновлять и&nbsp;упрощать ваш повседневный труд, предоставляя широкий ассортимент канцелярских товаров, которые сочетают в&nbsp;себе не&nbsp;только функциональность, но&nbsp;и&nbsp;стиль, принося удовлетворение от&nbsp;использования. Наша миссия заключается в&nbsp;том, чтобы создавать удобное онлайн-пространство, где вы&nbsp;можете легко находить необходимые товары, наслаждаться приятным опытом покупок и&nbsp;находить вдохновение для своих проектов.
          </p>
        </div>
        <div className="w-[450px]">
          <p>
            Благодарим вас за&nbsp;выбор нас, и&nbsp;мы&nbsp;с&nbsp;нетерпением ожидаем возможности делиться с&nbsp;вами радостью использования наших продуктов в&nbsp;вашем творческом и&nbsp;профессиональном процессе.
          </p>
        </div>
      </div>
    </>
  );
}
